Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: In OS X C<setreuid> and friends are troublesome - perl will now work around their problems as best possible.
es_es: En OS X, C<setreuid> y amigos, son molestos; perl ahora trabajará en torno a sus problemas de la mejor manera posible.

source: The old home for the module tests, you shouldn't put anything new in here.
es_es: Antiguo directorio de las pruebas de módulos. No debe colocar nada aquí.

source: To get platform independent controls, you can use C<\N{...}>.
es_es: Para obtener caracteres de control independientes de la plataforma, se puede utilizar C<\N{...}>.

source: To remove a directory tree recursively (C<rm -rf> on Unix) look at the C<rmtree> function of the L<File::Path> module.
es_es: Para eliminar un árbol de directorio recursivamente (C<rm -rf> en Unix) mire la función C<rmtree> del módulo L<File::Path>.

source: Exception: It is always safe to delete the item most recently returned by C<each()>, so the following code works properly:
es_es: Excepción: siempre es seguro borrar el último ítem devuelto por C<each()>, por lo que entonces el siguiente código funcionará correctamente:

source: Specify pre-requisites in Makefile.PL or Build.PL
es_es: Especifique los prerequisitos previos en Makefile.PL o Build.PL

source: If it is necessary to access these long values from outside Perl, be aware that they are implemented using search list logical names that store the value in pieces, each 255-byte piece (up to 128 of them) being an element in the search list.
es_es: Si es necesario acceder a estos valores largos desde el exterior de Perl, sea consciente de que se implementan utilizando los nombres de la lista de búsqueda lógica que almacena el valor en partes, de 255 bytes cada una (hasta 128 de ellas) de cada elemento de la lista de búsqueda.

source: Thanks to the people who asked about this kind of stuff in several Perl IRC channels, and have constantly reminded me that a simpler explanation was needed.
es_es: Todas las personas que han hecho preguntas sobre este tema en diversos canales IRC sobre Perl y que me han recordado constantemente lo necesaria que era una explicación más sencilla.

source: A failed match normally resets the search position to the beginning of the string, but you can avoid that by adding the C</c> modifier (e.g. C<m//gc>).
es_es: Una coincidencia fallida, normalmente, restablece la posición de búsqueda al principio de la cadena, pero puede evitarlo añadiendo el modificador C</c> (por ejemplo C<m//gc>).

source: This utility, that comes with the C<Digest::SHA> module, is used to print or verify SHA checksums.
es_es: Esta utilidad, que se incluye con el módulo C<Digest::SHA>, se usa para imprimir o comprobar sumas de control SHA.

source: For example, consider the following scenario.
es_es: Por ejemplo, considere el siguiente escenario.

source: Now shows elapsed time in milliseconds.
es_es: Ahora muestra el tiempo transcurrido en milisegundos.

source: README.haiku - Perl version 5.10+ on Haiku
es_es: README.haiku - Perl versión 5.10+ en Haiku

source: s/%(.)/$percent{$1}/g; # change percent escapes; no /e
es_es: s/%(.)/$porciento{$1}/g; # cambia los escapados con el %; sin /e

source: add LC_MESSAGES to POSIX :locale_h export tag
es_es: añadir LC_MESSAGES a la etiqueta de exportación :locale_h de POSIX

source: (Most of these one character names have a predefined significance to Perl.
es_es: (La mayor parte de estos nombres de un solo carácter tienen un significado predefinido para Perl.

source: n and m are limited to non-negative integral values less than a preset limit defined when perl is built.
es_es: n y m están limitados a enteros no negativos menores que un límite predefinido cuando perl se compiló.

source: They have strange names so they don't accidentally collide with one of your normal variables.
es_es: Éstas tienen extraños nombres, y por tanto no pueden colisionar accidentalmente con ninguna de sus variables normales.

source: printf '<%#.6x>', 1; # prints "<0x000001>"
es_es: printf '<%#.6x>', 1; # imprime "<0x000001>"

source: It is possible to replace such an alphanumeric name with an expression that returns a reference to the appropriate type.
es_es: Es posible sustituir cualquier nombre alfanumérico por una expresión que devuelva una referencia a un dato del tipo apropiado.

source: Further:
es_es: Además:

source: =item splice ARRAY or EXPR,OFFSET,LENGTH
es_es: =item splice ARRAY o EXPR,DESPLAZAMIENTO,LONGITUD

source: =item getpgrp PID X<getpgrp> X<group>
es_es: =item getpgrp PID X<getpgrp> X<group> X<grupo>

source: =head2 General tools
es_es: =head2 Herramientas de propósito general

source: Of course, Perl has its internal encoding to store the string in memory, but ignore that.
es_es: Por supuesto, Perl utiliza su propia codificación para almacenar la cadena en memoria, pero el usuario no tiene que conocer los detalles.

source: Not everything in Perl changes every day.
es_es: En Perl no todo cambia a diario.

source: This is the internal function implementing the C<\u> escape in double-quoted strings.
es_es: Esta es la función interna del escapado C<\u> en las cadenas doblemente entrecomilladas.

source: ... except inside quoted strings:
es_es: ... salvo cuando está entre comillas:

source: # a private exception trap for divide-by-zero
es_es: # un trampa privada para una excepción de división-por-cero

source: There may also be information at http://www.perl.com/, the Perl Home Page.
es_es: También puede haber información en http://www.perl.com/, La página oficial de Perl.

source: != inequality
es_es: != distinto que

source: while (($key,$value) = each $hashref) { ... }
es_es: while (($clave,$valor) = each $hashref) { ... }

source: \w a word character (a-z, A-Z, 0-9, _)
es_es: \w un carácter de palabra (a-z, A-Z, 0-9, _)

source: =item unpack TEMPLATE
es_es: =item unpack PLANTILLA

source: However, when backslashes are used as the delimiters (like C<qq\\> and C<tr\\\>), nothing is skipped.
es_es: Sin embargo, cuando se usan las barras invertidas como delimitadores (como C<qq\\> y C<tr\\\> ), no se omite nada.

source: =item setprotoent STAYOPEN
es_es: =item setprotoent SIGUEABIERTO

source: The TEMPLATE has the same format as in the C<pack> function.
es_es: La PLANTILLA tiene el mismo formato que en la función C<pack>.

source: s{}{} Substitution yes*
es_es: s{}{} Substitución sí*

source: Note that the lvalue returned by the three-argument version of substr() acts as a 'magic bullet'; each time it is assigned to, it remembers which part of the original string is being modified; for example:
es_es: Tenga en cuenta que el I<ivalor>> devuelto por la versión de tres argumentos de substr() actúa como una 'bala mágica'; cada vez que se le asigna, recuerda qué parte de la cadena original se ha modificado; por ejemplo:

source: Returns the offset of where the last C<m//g> search left off for the variable in question (C<$_> is used when the variable is not specified).
es_es: Devuelve el desplazamiento donde la última búsqueda C<m//g> terminó para la variable en cuestión (C<$_> es usada cuando no se especifica ninguna variable).

source: Loops, subroutines and other control structures allow you to jump around within the code.
es_es: Bucles, subrutinas y otras estructuras de control le permiten saltar a lo largo del código.

source: Some passes discussed below are performed concurrently, but because their results are the same, we consider them individually.
es_es: Algunos pases discutidos a continuación se realizan de forma simultanea, pero como sus resultados son los mismos, los consideramos por separado.

source: =head1 Examples
es_es: =head1 Ejemplos

source: =item exec LIST X<exec> X<execute>
es_es: =item exec LISTA X<exec> X<execute> X<ejecutar>

source: A scalar is a single string (of any size, limited only by the available memory), number, or a reference to something (which will be discussed in L<perlref>).
es_es: Un escalar es una cadena de caracteres (de cualquier tamaño, limitada únicamente por la memoria disponible), un número o una referencia a algo (esto se tratará en L<perlref>).

source: tr/a-zA-Z//s; # bookkeeper -> bokeper
es_es: tr/a-zA-Z//s; # coonnttaable -> contable

source: Breaking complex templates into individual line-by-line components, suitably annotated, can do as much to improve legibility and maintainability of pack/unpack formats as C</x> can for complicated pattern matches.
es_es: Rompiendo plantillas complejas en líneas individuales, debidamente comentadas, puede servir para mejorar la legibilidad y facilitar el mantenimiento de los formatos pack/unpack, como C</x> lo es para las expresiones regulares complicadas.

source: ($foo = "$bar") =~ s/this/that/; # convert to string, copy, then change
es_es: ($foo = "$bar") =~ s/este/aquel/; # convierte a cadena, copia, y luego cambia

source: A second C<e> modifier will cause the replacement portion to be C<eval>ed before being run as a Perl expression.
es_es: Un segundo modificador C<e> hará que la parte de reemplazo sea C<eval>uada antes de la ejecución como una expresión Perl.

source: Evaluates the BLOCK or EXPR for each element of LIST (locally setting C<$_> to each element) and returns the list value composed of the results of each such evaluation.
es_es: Evalúa el BLOQUE o EXPR para cada elemento de LISTA (poniendo localmente C<$_> a cada elemento) y devuelve una lista de valores compuesta de los resultados de cada evaluación.

source: A new option, Pair, allows choosing the separator between hash keys and values.
es_es: Una nueva opción, Pair, permite elegir el separador entre las claves y valores de un hash.

source: # Find a hex digit.
es_es: # Buscar un dígito hexadecimal.

source: =head1 Changed Internals
es_es: =head1 Cambios internos

source: Implements the fcntl(2) function.
es_es: Implementa la función fcntl(2).

source: Any following text is ignored.
es_es: Cualquier texto que le siga, es ignorado.

source: Extension modules can also hook into the Perl parser to define new kinds of compound statement.
es_es: Hay módulos de extensiones que también pueden engancharse en el intérprete de Perl para definir nuevas clases de instrucciones compuestas.

source: All variants of Unix, Mac OS (old and new), and Stream_LF files on VMS use a single character to end each line in the external representation of text (even though that single character is CARRIAGE RETURN on old, pre-Darwin flavors of Mac OS, and is LINE FEED on Unix and most VMS files).
es_es: Todas las variantes de Unix, Mac OS (viejo y nuevo) y los archivos Stream_LF sobre VMS usan un único carácter al final de cada línea en la representación externa del texto (incluso si el carácter único es un RETORNO DE CARRO en el antiguo, pre-Darwin sabor de Mac OS, y un AVANCE DE LÍNEA en los Unix y la mayor parte de los archivos VMS).

source: If the argument is omitted, tests C<$_>, except for C<-t>, which tests STDIN.
es_es: Si el argumento se omite, se prueba C<$_>, excepto para C<-t>, que prueba STDIN.

source: ord("z")) gives "2ab"
es_es: ord("z")) da "2ab"

source: Better to omit it.
es_es: Es mejor omitirlo.

source: Creates a new filename symbolically linked to the old filename.
es_es: Crea un nuevo nombre de archivo vinculado simbólicamente al nombre del archivo antiguo.

source: POSIX::sigprocmask function can now retrieve the current signal mask without also setting it.
es_es: La función POSIX::sigprocmask ahora puede recuperar la máscara de señales actual sin tener que establecerla.

source: If you'd like to manually inspect C<system>'s failure, you can check all possible failure modes by inspecting C<$?> like this:
es_es: Si desea inspeccionar manualmente el error de C<system>, puede comprobar todas las posibles causas del error mediante la inspección de C<$?> como esto:

source: print $rex; # prints (?si-xm:my.STRING)
es_es: print $rex; # imprime (?si-xm:mi.CADENA)

source: It's well established that modern programs need to be capable of communicating funny accented letters, and things like euro symbols.
es_es: Los programas modernos deben poder comunicar caracteres acentuados o símbolos como el del euro.

source: Here's how you get at elements in an array:
es_es: Para obtener los elementos de un array:

source: Here $subroutine may be C<(eval)> if the frame is not a subroutine call, but an C<eval>.
es_es: Aquí, $subrutina puede ser C<(eval)> si el marco de llamada no es una llamada a una subrutina, sino un C<eval>.

source: add the \[$@%&*] prototype support
es_es: añadir soporte al prototipado de \[$@%&*]

source: C<canonpath()> on Win32 now collapses F<foo\..> sections correctly.
es_es: C<canonpath()> en Win32 ahora colapsa secciones F<foo\..> correctamente.

source: Perhaps you could move them?
es_es: ¿Se anima a moverlas?

source: if ( /$pattern/i ) { }
es_es: if ( /$patron/i ) { }

source: Don't forget Perl modules, either.
es_es: Y no olvidemos los módulos Perl.

source: CLOSE this
es_es: CLOSE este

source: So to split a string into individual characters, the following:
es_es: Así que para dividir una cadena en caracteres individuales, lo siguiente:

# Not all systems read C<""> as ASCII CR and C<" "> as ASCII LF.
source: Not all systems read C<"\r"> as ASCII CR and C<"\n"> as ASCII LF.
es_es: No todos los sistemas leen C<"\r"> como ASCII CR y C<"\n"> como ASCII LF.

source: You can arrange for a callback to be run just before the C<die> does its deed, by setting the C<$SIG{__DIE__}> hook.
es_es: Puede disponer que una retrollamada se ejecute antes de que C<die> haga sus funciones, actualizando el gancho C<$SIG{__DIE__}>.

source: Because Perl stringifies uncaught exception messages before display, you'll probably want to overload stringification operations on exception objects.
es_es: Como Perl convertirá en cadena de caracteres los mensajes de excepción no capturados antes de mostrarlos, quizás quiera sobrecargar las operaciones de conversión a cadena en objetos de excepción.

source: A PATTERN of C</^/> is treated as if it were C</^/m>, since it isn't much use otherwise.
es_es: Un PATRÓN C</^/> es tratado como si fuera C</^/m>, ya que de lo contrario no serviría de mucho.

source: # In Foo.pm
es_es: # En Foo.pm

source: Returns the currently selected filehandle.
es_es: Devuelve el identificador de archivo seleccionado.

source: It is at this step that C<\1> is begrudgingly converted to C<$1> in the replacement text of C<s///>, in order to correct the incorrigible I<sed> hackers who haven't picked up the saner idiom yet.
es_es: Es en este paso que C<\1> es convertido, de mala gana, en C<$1> en el texto de reemplazo de C<s///>, con el fin de corregir a los incorregibles hackers de I<sed> que todavía no han aprendido la correcta forma de indicar esta expresión.

source: Internal cleanup only
es_es: Solo limpieza interior

source: If an element off the end of the string is written to, Perl will first extend the string with sufficiently many zero bytes.
es_es: Si se escribe un elemento al final de la cadena, Perl primero extenderá la cadena con una cantidad suficiente de bytes cero.

source: If "'" is the delimiter, no interpolation is performed on the PATTERN.
es_es: Si "'" "es el delimitador, no se realiza interpolación en el PATRÓN.

source: perlmacos Perl notes for Mac OS (Classic)
es_es: perlmacos Notas para Mac OS (Classic)

source: In scalar context, the behaviour of C<sort()> is undefined.
es_es: En contexto escalar, el comportamiento de C<sort()> es indefinido.

source: or perhaps as a real reference, like this:
es_es: o tal vez como una referencia real, de esta manera:

source: Finally, quoted strings cannot span multiple lines.
es_es: Por último, las cadenas entrecomilladas no puede abarcar varias líneas.

source: C<:utf8> just marks the data as UTF-8 without further checking, while C<:encoding(UTF-8)> checks the data for actually being valid UTF-8.
es_es: C<:utf8> solo marca los datos como UTF-8 sin más comprobaciones ulteriores, mientras que C<:encoding(UTF-8)> comprueba que los datos sean UTF-8 válidos.

source: This makes it easier to keep the documentation up to date, and avoids having to document each piece of code twice (once in POD and once in comments).
es_es: Esto hace que sea más fácil mantener la documentación al día, y evita tener que documentar cada pieza de código dos veces (una en POD y otra vez en los comentarios).

source: If you know what version or patchlevel a particular feature was implemented, you can test C<$]> (C<$PERL_VERSION> in C<English>) to see if it will be there.
es_es: Si usted sabe en qué versión o patchlevel fue implementada una cierta característica, puede comprobar C<$]> (C<$PERL_VERSION> en C<English>) para ver si está incluida.

source: exec @args; # subject to shell escapes # if @args == 1
es_es: exec @args; # sujeto a los escapados del shell # if @args == 1

source: C<Tie::Hash> upgraded to version 1.02
es_es: C<Tie::Hash> actualizado a la versión 1.02

source: With an C<eval>, you should be especially careful to remember what's being looked at when:
es_es: Dentro de C<eval>, debe, especialmente, recordar que es lo que está haciendo en cada momento:

source: perl570delta Perl changes in version 5.7.0
es_es: perl570delta Cambios en la versión 5.7.0

source: <TTY> =~ /^y/i && foo(); # do foo if desired
es_es: <TTY> =~ /^s/i && foo(); # hacer foo() si así se desea

source: =head2 Perl Functions by Category X<function>
es_es: =head2 Funciones Perl por categoría X<function> X<función>

source: 2 mode 2 hour 2 line $/ input separator
es_es: 2 mode 2 hora 2 línea $/ separador entrada

source: our $x; my $x; # warns
es_es: our $x; my $x; # avisa

source: Note also that, currently, C<\G> is only properly supported when anchored at the very beginning of the pattern.
es_es: Tenga en cuenta también que, actualmente, C<\G> está sólo adecuadamente soportado cuando es anclado al comienzo del patrón.

source: Any pattern containing a special backtracking verb that allows an argument has the special behaviour that when executed it sets the current package's C<$REGERROR> and C<$REGMARK> variables.
es_es: Cualquier patrón que contenga un verbo especial para la vuelta atrás que permita un argumento, tiene el comportamiento especial de que cuando es ejecutado establece las variables C<$REGERROR> y C<$REGMARK> en el paquete actual.

source: Do not consider one style to be better than others - "There Is More Than One Way Of Doing It" is one Perl's mottos.
es_es: Ningún estilo es mejor que otro. No olvide que uno de los lemas de Perl es "Se puede hacer de varias maneras".

source: Make sure that your module has a license, and that the full text of it is included in the distribution (unless it's a common one and the terms of the license don't require you to include it).
es_es: Asegúrese de que el módulo tiene una licencia, y que el texto completo de la misma está incluida en la distribución (a menos que sea muy común y los términos de la licencia no requieran que la incluya).

source: However any other combinations of C<\> followed by a character are not substituted but only skipped, in order to parse them as regular expressions at the following step.
es_es: No obstante, cualquier otra combinación de C<\> seguido de un carácter no va a ser sustituido, sino sólo obviado, con el fin de analizarlos como expresiones regulares en el paso siguiente.

source: =item Interpolation X<interpolation>
es_es: =item Interpolación X<interpolation> X<interpolación>

source: The possible modifiers are:
es_es: Los posibles modificadores son:

source: C</> will finish the regular expression, C<\/> will be stripped to C</> on the previous step, and C<\\/> will be left as is.
es_es: C</> terminará la expresión regular, C<\/> será reducido a C</> en el paso anterior, y C<\\/> será mantenido tal cual.

source: is just a funny way to write
es_es: es sólo una manera divertida de escribir

source: print ++($foo = "a0"); # prints "a1"
es_es: print ++($foo = "a0"); # imprime "a1"

source: =head3 Internal format
es_es: =head3 Formato interno

source: Character mode is the default unless the format string starts with C<U>.
es_es: El modo carácter es el defecto a menos que la cadena de formato se inicia con C<U>.

source: For more information about perlbug, either type 'perldoc perlbug' or just 'perlbug' on a line by itself.
es_es: Para obtener más información acerca de perlbug, escriba 'perldoc perlbug', o simplemente, 'perlbug' en la misma línea de comandos

source: A useful idiom for C<lex>-like scanners is C</\G.../gc>.
es_es: Un modismo útil para escáneres tipo C<lex> es C</\G.../gc>.

source: @matches = ( 'foo' =~ m{ o?
es_es: @coincidencias = ( 'foo' =~ m{ o?

source: =head2 Optimization of shift; and pop; calls without arguments
es_es: =head2 Optimización de llamadas shift; y pop; sin argumentos

source: You can also subscript a list to get a single element from it:
es_es: También puede subindexar una lista para obtener un solo elemento de ella.

source: Other restrictions include whether it works on directories, open files, or pre-existing files.
es_es: Otras restricciones incluyen si funciona en directorios, archivos abiertos, o archivos pre-existentes.

# print "Text " if -T _;
source: print "Text\n" if -T _;
es_es: print "Texto\n" if -T _;

source: If the value to pack is too long, the result is truncated.
es_es: Si el valor a empaquetar es demasiado largo, el resultado se trunca.

source: C<-I<X>>, C<chdir>, C<chmod>, C<chown>, C<chroot>, C<fcntl>, C<glob>, C<ioctl>, C<link>, C<lstat>, C<mkdir>, C<open>, C<opendir>, C<readlink>, C<rename>, C<rmdir>, C<stat>, C<symlink>, C<sysopen>, C<umask>, C<unlink>, C<utime>
es_es: C<chomp>, C<chop>, C<chr>, C<crypt>, C<hex>, C<index>, C<lc>, C<lcfirst>, C<length>, C<oct>, C<ord>, C<pack>, C<q//>, C<qq//>, C<reverse>, C<rindex>, C<sprintf>, C<substr>, C<tr///>, C<uc>, C<ucfirst>, C<y///>

source: perlfilter Perl source filters
es_es: perlfilter Filtros de código fuente

source: # pack big-endian 16- and 32-bit unsigned integers
es_es: # empaqueta 16 y 32-bit enteros sin signo, en big-endian

source: =item atan2 Y,X X<atan2> X<arctangent> X<tan> X<tangent>
es_es: =item atan2 Y,X X<atan2> X<arctangent> X<tan> X<tangent> X<arcotangente> X<tangente>

source: The equivalence of strings and v-strings (e.g. that currently 5.8.0 is equal to "\5\8\0") will go away.
es_es: La equivalencia de cadenas y v-strings (p. e., que en la actualidad 5.8.0 es igual a "\5\8\0") va a desaparecer.

source: These arguments are also evaluated from left to right.
es_es: Estos argumentos también son evaluados de izquierda a derecha.

source: You may or may not choose to follow this usage.
es_es: Usted puede elegir adoptarla o no.

source: When the data is aggregated in obvious structures that will become objects
es_es: Cuando los datos se agregan en estructuras tan obvias que se convertirán en objetos

source: Use of any other character following the "c" besides those listed above is discouraged, and some are deprecated with the intention of removing those in Perl 5.16.
es_es: No se recomienda el uso de cualquier otro carácter después de la "c", aparte de los mencionados anteriormente, y algunos de ellos están en desuso, con la intención de eliminarlas en Perl v5.16.

source: The L<Time::gmtime> and L<Time::localtime> modules provide a convenient, by-name access mechanism to the gmtime() and localtime() functions, respectively.
es_es: Los módulos L<Time::gmtime> y L<Time::localtime> proporcionan convenientes mecanismos de acceso por nombres para las funciones gmtime() y localtime(), respectivamente.

source: The standard release of perl (the one maintained by the perl development team) is distributed only in source code form.
es_es: La versión estándar de perl (la mantenida por el equipo de desarrollo de perl) sólo se distribuye en forma de código fuente.
